geometries/naca0012/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 0;
    }
    airfoil
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    top
    {
        type            freestream;
        freestreamValue uniform 0;
    }
    bottom
    {
        type            freestream;
        freestreamValue uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
