geometries/naca0012/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    airfoil
    {
        type            zeroGradient;
    }
    top
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    bottom
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
